Revit 2027 API
RebarContainerItem.ArrayLength Property
 Identifies the distribution path length of rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ArrayLength { get; set; }
Public Property ArrayLength As Double
	Get
	Set
public:
property double ArrayLength {
	double get ();
	void set (double value);
}
member ArrayLength : float with get, set
Property Value
Double
 The distribution path length of rebar set.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the set length arrayLength isn't acceptable.
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace